{"inkVersion":20,"root":[[{"#":"bg Courtyard"},{"#":"name MC"},"^Hey there, may I pass through?","\n",{"#":"name MC"},"^I have some important business to attend to with the heads of House Ivy.","\n",{"#":"name Guard-Bellaben-Sliver"},{"#":"sprite BellabenSliverIdle"},"^And who might you be?","\n",{"#":"name MC"},"^Uhhh, I'm a delegate from House Holly.","\n",{"#":"name MC"},"^My leaders were hoping to establish some communication regarding the recent events.","\n",{"#":"name Guard-Bellaben-Sliver"},{"#":"sprite BellabenSliverIdle"},"^Then you should know that House Ivy is not taking any visitors, delegates or otherwise, until further notice.","\n",{"#":"name Guard-Bellaben-Sliver"},{"#":"sprite BellabenSliverIdle"},"^We are dealing with recent events as much as you are,","\n",{"#":"name Guard-Bellaben-Sliver"},{"#":"sprite BellabenSliverIdle"},"^and for the time being, none are allowed within.","\n",{"#":"name Guard-Bellaben-Sliver"},{"#":"sprite BellabenSliverIdle"},"^Leave the premises or be escorted off.","\n",{"#":"name MC"},"^Very well then.","\n",{"#":"name MC"},"^I shall let my leaders know of these occurrences.","\n",{"#":"sound Dial"},{"#":"name Ariar"},{"#":"sprite Phone"},"^Was wondering when you'd hit me up.","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^Did the pizza delivery ruse make yet another successful encore?","\n",{"#":"name MC"},"^Unfortunately no, seems like Philel was not in the mood for the sauce tonight, and they're not seeing any visitors either.","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^Well I know you never hope for that stuff to work anyways.","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^If it's easy, that means you should at least give it a shot. If you don't get the results you're looking for,","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^you can always start trying out different methods.","\n",{"#":"name MC"},"^I also prefer to work without too much deception.","\n",{"#":"name MC"},"^We're here to reveal the truth, and any step in the other direction is one I would rather not take.","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^Fine fine, whatever works for you.","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^What are we looking at in terms of security there?","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^Never had the pleasure of looking at House Ivy's security,","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^but something tells me you're going to be wishing you were delivering pizza by the end of tonight.","\n",{"#":"name MC"},"^It's honestly quite impressive, I've never seen runes this complex before.","\n",{"#":"name MC"},"^They're really serious about keeping anyone out.","\n",{"#":"name MC"},"^Some kind of sensory link enchantment that not only prevents entry, but seems to monitor all that takes place on the barrier.","\n",{"#":"name MC"},"^Not exactly a hair trigger, but I'm going to be wary of even tossing a pebble in to test the measures they've got behind it.","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^Then that means you're going to need to get extra creative now.","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^I'll try looking into some befuddlement charms.","\n",{"#":"name Ariar"},{"#":"sprite Phone"},"^They might be able to circumvent a sensory link-type barrier, though you'll still need to punch through it.","\n",{"#":"name MC"},"^Alrighty then, send me the info when you find it, I'll try out some tricks of my own.","\n",{"#":"sprite none"},{"#":"name MC"},"^Then I suppose that it's up to me to figure a way to get in.","\n",{"#":"sound MagicBarrier1"},{"#":"sound MagicBarrier2"},{"#":"sound MagicBarrier3"},"^After some time is passes, and they appear frustrated, the protection around House Ivy being more secure than they could have ever anticipated.","\n",{"#":"name MC"},"^Damn, they're really pulling no punches here.","\n",{"#":"name MC"},"^They must really value personal security, or they have something to hide.","\n",{"#":"name MC"},"^And no calls from Ariar, I guess the charm route didn't lead to anything.","\n","^Quietly plodding along the perimeter of the barrier you whisper a small incantation under their breath.","\n",{"#":"name MC"},"^Quod sentis non est halitus, torpens, serenus, tacitus met.","\n",{"#":"sound Fizzle"},{"#":"name MC"},"^Come on, that is the limit?","\n",{"#":"name MC"},"^How am I supposed to cross through an arcane barrier without a lick of magic to help me out?","\n",{"#":"sound PortalActive"},{"#":"sprite Portal"},"^An electric crackling noise sounds out, and you turn around as a tear forms near the barrier. It widens, revealing the interior of a hallway, emblems of House Ivy giving context of the location.","\n",{"#":"name MC"},"^Huh? What's this?","\n",{"#":"name MC"},"^It's not like any magic I've seen before, and I've certainly not cast it.","\n",{"#":"name MC"},"^Wait, is this some kind of rift?","\n",{"#":"name MC"},"^Is the destabilization of magic causing space itself to break down in places?","\n",{"#":"name MC"},"^I can see through it, it is House Ivy!","\n",{"#":"sound none"},{"#":"name MC"},"^This makes little sense, but it's the best bet I've found so far.","\n",{"#":"bg HouseIvy"},{"#":"sound PortalEnter"},{"#":"name MC"},"^Wow. That works.","\n",{"#":"name MC"},"^Surely a danger to the world, but at least it was a danger that benefitted me for once.","\n",{"#":"name MC"},"^Now to begin searching for evidence.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^I don't expect you have any good reason for sneaking around my House so dishonorably?","\n",{"#":"name MC"},"^Oh, hey, it's you.","\n",{"#":"name MC"},"^Great.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Our borders are closed. How did you get in?","\n",{"#":"name MC"},"^Well, frankly, I'm not too sure myself.","\n",{"#":"name MC"},"^It was very strange.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^I am not a fool, child.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^The only possible way for you to have entered is by bribing a guard.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Give me names.","\n",{"#":"name MC"},"^Brilliant deduction, Levalon.","\n",{"#":"name MC"},"^But unfortunately it's completely incorrect.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Stop stalling.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^You are in direct violation with the laws of House Ivy.","\n",{"#":"name MC"},"^Yes, yes.","\n",{"#":"name MC"},"^I'm very familiar with the law.","\n",{"#":"name MC"},"^I'm a detective.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Yes, I am familiar with your work, being neutral and all.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^However, despite being neutral from all houses, that does not give you free reign to break the House laws.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^While you are here, you will be treated to the same justice.","\n",{"#":"name MC"},"^Don't tell me about justice. The only reason I am here is because your own house doesn't trust you anymore.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Naturally. That is why our borders are closed.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^We must prove our own innocent before allowing ourselves to be seen in scrutiny.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Unless you have proof of your innocence, there is no need for our discussion.","\n",{"#":"name MC"},"^I hope you understand that the only reason I am here is to prove you innocent.","\n",{"#":"name MC"},"^I understand why you closed your boarders, but that has only made the public question you more.","\n",{"#":"name MC"},"^I was asked to investigate your house with an unbiased eye.","\n",{"#":"name MC"},"^If it is true that your House did commit these crimes, there will be a revolt. The only thing greater to a Duhhahan than loyalty is pride.","\n",{"#":"name MC"},"^They will not tolerate acts of an unjust war. So, if you are innocent, I am the one who can save you.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^You are wise.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^That I must regrettably admit.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^But there is no benefit to us making enemies of the world.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^I will certainly condemn Sir Richter for his behavior at the council. But he was correct about one thing.","\n",{"#":"name MC"},"^What is that?","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^That the most important matter to House Ivy is maintaining the laws enacted by our ancestors.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^House Ivy seeks to keep peace.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Right now, the public needs a House to blame with anger.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^For the time being, we are that house, but we must soon use this anger to punish those who have sought to harm this world and all who inhabit it.","\n",{"#":"name MC"},"^We are in agreement, Levalon.","\n",{"#":"name MC"},"^We both hope that those truly guilty will face the fullest consequence for their behavior.","\n",{"#":"name MC"},"^I simply hope that is not you.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Something that will be proven in time.","\n",{"#":"name MC"},"^I suppose you're not still wondering how I got here?","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^A question that no longer needs to be answered.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^I recognize you entered our House with noble intent.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Even if that nobility involved breaking the law.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^You will not be punished, despite your guilt. You are one of good morals. That is a vanishing breed.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^I cannot provide aid in your quest, but I will not punish you for trying.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^But rest assured, House Ivy still takes the law quite seriously.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Any further attempt to break our law will be punished, regardless of how noble the cause.","\n",{"#":"name MC"},"^I understand, Levalon.","\n",{"#":"name MC"},"^Thank you for your generosity. If you are truly innocent, I wish you the best of fortunes to prove that innocence in a timely manner.","\n",{"#":"name Levalon-Philel"},{"#":"sprite LevalonPhilelIdle"},"^Indeed. But you must now leave.","\n",{"#":"name MC"},"^I will. And I will not argue.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}