{"inkVersion":20,"root":[["^Location: MCs House","\n","^Opens with MC in their House. There is a knock on the door.","\n",{"#":"name MC"},"^Ah, Ariar, come in.","\n",{"#":"name Ariar"},"^You asked to see me?","\n",{"#":"name MC"},"^Yes, I know.","\n",{"#":"name Ariar"},"^How did your investigation in House Ivy go?","\n",{"#":"name MC"},"^Not great, unfortunately.","\n",{"#":"name Ariar"},"^Tell me what happened.","\n",{"#":"name MC"},"^Well, apparently I'm not that good at sneaking around, and Levalon caught me.","\n",{"#":"name Ariar"},"^Yeah, I figured if you had obtained any significant information, you would have called me.","\n",{"#":"name MC"},"^Sorry. I've needed some time to process things.","\n",{"#":"name Ariar"},"^No need to apologize, I get it. But I'm curious about something.","\n",{"#":"name MC"},"^What's that?","\n",{"#":"name Ariar"},"^How did you get in?","\n",{"#":"name MC"},"^How many times am I going to get asked that?","\n",{"#":"name Ariar"},"^Many times, I'd imagine. Because it makes no sense. House Ivy's borders are infamously impenetrable. If there is something weird going on I need to know.","\n",{"#":"name MC"},"^In that case, you should know that the magic there was destabilizing.","\n",{"#":"name Ariar"},"^The magic everywhere is destabilizing. That's not new.","\n",{"#":"name MC"},"^Let me finish. The destabilized magic does more than just weaken one's magic abilities. Tell me, Ariar, where does magic come from?","\n",{"#":"name Ariar"},"^Well, it's an atmospheric substance that can be controlled.","\n",{"#":"name MC"},"^Right, so if magic is destabilizing, then we can infer that the atmosphere itself is destabilizing.","\n",{"#":"name Ariar"},"^What are you getting at?","\n",{"#":"name MC"},"^Well, the atmosphere is destabilizing, and it's causing rifts.","\n",{"#":"name Ariar"},"^Rifts?","\n",{"#":"name MC"},"^Yes, rifts. There are tears in the atmosphere. There was one right outside House Ivy, and I went through it.","\n",{"#":"name Ariar"},"^You went through it?","\n",{"#":"name MC"},"^You say that as if I could have died.","\n",{"#":"name Ariar"},"^You absolutely could have died!","\n",{"#":"name MC"},"^Well, lucky for me, I didn't. But when I went through I ended up in House Ivy.","\n",{"#":"name Ariar"},"^Incredible.","\n",{"#":"name MC"},"^Yeah, it was great until I got caught.","\n",{"#":"name Ariar"},"^No no, not that.","\n",{"#":"name MC"},"^Oh.","\n",{"#":"name Ariar"},"^All the evidence fits into place now. It all makes sense, my friend!","\n",{"#":"name MC"},"^You're welcome to share, Ariar.","\n",{"#":"name Ariar"},"^Right, yes, of course. As you know the public believes House Ivy to be guilty.","\n",{"#":"name MC"},"^Indeed, which is why I investigated them.","\n",{"#":"name Ariar"},"^Yes, I know. But while you were there I was doing my own investigation. All the evidence made me think that House Ivy was to blame, but I couldn't be sure. My friend, this is the last piece of evidence.","\n",{"#":"name MC"},"^You're welcome?","\n",{"#":"name Ariar"},"^Let me explain. At the Council, it was House Ivy who started the fight. Then, when everyone blamed them, did they have any evidence to refute the claim? No, they hid themselves from the world, as if they had something to hide. As suspicious as this was, I assumed that if those from House Ivy were all held within the borders, they would be unable to harm the world outside. But, as you have discovered, there are portals being used to enter and exit the house. Why would they close the borders and still have a hidden portal to enter and exit? They must be guilty.","\n",{"#":"name MC"},"^Ariar, I'm not so sure. This is a bold claim.","\n",{"#":"name Ariar"},"^Do you know the sin of House Ivy?","\n",{"#":"name MC"},"^Yes, of course. It's Pride.","\n",{"#":"name Ariar"},"^Indeed. House Ivy is a proud house. They would defend their honor at all cost.","\n",{"#":"name MC"},"^Or it could be the opposite. Maybe they recognize that any public exposure would only hurt their image.","\n",{"#":"name Ariar"},"^Perhaps. I admit this is possible. But consider the motive behind destabilizing magic. What if House Ivy thought the rest of the world unworthy? What if they wanted the power of magic for themselves, thus making them superior to all other Houses? This makes too much sense.","\n",{"#":"name MC"},"^I agree. House Ivy is certainly a significant suspect in this crime, but we must be certain before we take action.","\n",{"#":"name Ariar"},"^We are certain. At least, I am. Sorry I don't want to impose my beliefs on you.","\n",{"#":"name MC"},"^It's fine.","\n",{"#":"name Ariar"},"^If we wait any longer there will be no use. House Ivy will have conquered the world. There is still time to fight back.","\n",{"#":"name MC"},"^But what if we fight the wrong fight? What if House Ivy is innocent, then the true criminal will be able to conquer the world with ease.","\n",{"#":"name Ariar"},"^How long have we worked together?","\n",{"#":"name MC"},"^Years. Many years.","\n",{"#":"name Ariar"},"^When have I ever been proven wrong?","\n",{"#":"name MC"},"^Two nights ago when you told me to go to that warehouse.","\n",{"#":"name Ariar"},"^That was a mistake, I'll yield, but I also saved your life.","\n",{"#":"name MC"},"^Yes. You did. And I do enjoy being alive, so thank you. However, Ariar, we have a reputation. The citizens of this world trust us. We must be certain beyond doubt before we act upon something so significant.","\n",{"#":"name Ariar"},"^I only wish to protect the citizens of this world.","\n",{"#":"name MC"},"^In that, we have the same intention.","\n","^There is a knocc on the front door","\n",{"#":"name MC"},"^One moment, the door. But we're not done with this conversation.","\n",{"#":"name Ariar"},"^I know.","\n","^The MC opens the front door, revealing a somewhat disheveled looking devil, a member of Spider Lily.","\n",{"#":"name Levili Clu"},"^Oh good, you're home! I've been trying to find you everywhere.","\n",{"#":"name MC"},"^You've been looking for me? Who are you?","\n",{"#":"name Levili Clu"},"^I am Levili Clu, of House Spider Lily, though my status among my people has fallen greatly since you have last seen me. I was hoping to see you about that.","\n",{"#":"name MC"},"^Listen, I don't care what rumors have been spread, but I don't deal in blackmail jobs. I might not be aligned with a house, but I have my own code of honor to uphold.","\n",{"#":"name Levili Clu"},"^Apologies, but that is not what I am here about. I heard that you too have suffered the same malady that has been spreading across the land. The degradation of one's magical power.","\n",{"#":"name MC"},"^Yes, that is the case. What does it matter to you?","\n",{"#":"name Levili Clu"},"^I was hoping that you had discovered something more. I've been hearing about how House Ivy has pulled themselves out of external affairs and sealed their borders tighter than a otter-tortoise.","\n",{"#":"name MC"},"^Well you're not wrong in that regard, but may I ask the purpose of your business?","\n",{"#":"name Levili Clu"},"^Well I'm afraid that my condition is even worse than your own my friend. For the past few days, I haven't been able to summon up anything, not even a single spark. I fear that I've hit the bottom of my power, and I've been looking for a way to bring it back. House Ivy still retains some of it's magic power?","\n",{"#":"name MC"},"^Do they?","\n",{"#":"name Levili Clu"},"^There is no other use to their hiding. I have no authority to speak on behalf of House Spider-Lily, but be assured that House Spider-Lily will not be able to remain peaceful until our magic powers are restored.","\n",{"#":"name MC"},"^I see.","\n",{"#":"name Ariar"},"^So could this be the start of a House War?","\n",{"#":"name Levili Clu"},"^That is inevitable.","\n",{"#":"name Ariar"},"^I knew it. Friend, this is why immediate action is necessary. Any delay and there may no longer be a world to save.","\n",{"#":"name MC"},"^Ariar, we must be careful.","\n",{"#":"name Ariar"},"^Caution is a luxury of time, and unfortunately our time is fleeting.","\n",{"#":"name MC"},"^Time is always fleeting. But you're right, the time for action is especially fleeting now. However, the notion of immediate action is something with which I cannot agree.","\n",{"#":"name Ariar"},"^Saving the world is never easy, friend. I think no less of you despite our disagreement. But we are truly on the verge of a House War, and if we do not take proper action, our world, along with all who inhabit it, are doomed. I cannot speak with certainty that House Ivy is guilty, though I see no possibility more reasonable. If we are wrong, and House Ivy falls on our action, this would truly be disappointing, and I will take full responsibility. Yet, if no action is taken, House Ivy will still fall. There is a chance to save the world. We just have to take a risk.","\n",{"#":"name MC"},"^Perhaps you are correct. The House War may be nearer than you expect. The alliance between Houses was always weak. Any minor disturbance could have caused a fatal fracture.","\n",{"#":"name Levili Clu"},"^The loss of magic is no minor disturbance.","\n",{"#":"name Ariar"},"^Yes, we are aware, Levili.","\n",{"#":"name MC"},"^I am not sure if you are correct, Ariar, but I will trust you.","\n",{"#":"name Ariar"},"^Your support is appreciated.","\n",{"#":"name MC"},"^However, I do it on my own terms. I believe we are all well aware that the constables will not take forceful action against any Houses at this point.","\n",{"#":"name Ariar"},"^You are quite correct.","\n",{"#":"name MC"},"^So am I to understand we intend on making our own attack against House Ivy?","\n",{"#":"name Levili Clu"},"^House Spider-Lily is planning such an attack imminently.","\n",{"#":"name MC"},"^In this case, I will allow the attack to continue, but I will not make any direct attack against House Ivy.","\n",{"#":"name Ariar"},"^Very well.","\n",{"#":"name Levili Clu"},"^Perhaps you would still be able to provide us aid in this attack.","\n",{"#":"name MC"},"^How so?","\n",{"#":"name Levili Clu"},"^The strongest warrior in House Ivy is Levalon himself. If you could provide a distraction-","\n",{"#":"name MC"},"^No need to continue, Levili. I have a plan.","\n",{"#":"name Levili Clu"},"^Your support is appreciated.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}