{"inkVersion":20,"root":[["^Location: Your House","\n",[[{"#":"bg MCHouse"},{"#":"name MC"},{"#":"sprite MCWeakened"},"^Ugh... what time is it? I feel awful. That magic really did me in.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Well, if you want an answer to your question, it's 3 in the afternoon.","\n",{"#":"name MC"},{"#":"sprite MCWeakened"},"^Wha- How did that happen? Why are you here?","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^You're one for questions today, aren't you?","\n",{"#":"name MC"},{"#":"sprite MCWeakened"},"^As long as you're here to answer them.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^In that case, I came in this morning and you weren't there. I knew you were tired last night, but it's unusual for you to just... not show up. So I came over here to see how you were. What happened last night to put you in this state?","\n",{"#":"name MC"},{"#":"sprite MCWeakened"},"^To be perfectly honest, Ariar. Something weird happened.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Do tell.","\n",{"#":"name MC"},{"#":"sprite MCWeakened"},"^Well, as you know, I was attacked out of nowhere. And I hate to admit it, but I was losing the battle. So I tried to attack with magic, but it was wrong.","\n",{"#":"name MC"},{"#":"sprite MCWeakened"},"^My magic was weaker than normal, and it drained my energy. I could hardly muster the call to you, and when I did I could hardly keep fighting. I don't know what happened, but I didn't like it.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^I see. Well, you're not the only one.","\n",{"#":"name MC"},{"#":"sprite MCShocked"},"^Huh?","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Last night there was a sudden surge in reports of lost magic. It seems to be affecting all magic-users. Symptoms are, well, I don't really need to explain the symptoms to you, since you just went through it.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Right, and it didn't feel good.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Yeah, the worlds been in a bit of a panic. The House leaders are having a council today to discuss the matter and how to handle it.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^That must mean it's serious. I have to go.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^I knew you would, but unfortunately only House members are invited to sit in. And unfortunately, because I work with you, I haven't been invited.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^I have to get in. I need to know what's going on. Unless you want to go, of course. One of us should stay behind again. If the Houses really are going to war, it's best for us to be safe.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^I agree. We must be cautious from now on, but I think this mission would be better for you. I figured you would want to go, so I have a plan to sneak you in. Which reminds me, do you mind the smell of sewage?","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Not as much as I mind losing my magic.","\n",{"#":"name Ariar"},{"#":"sprite AriarHappy"},"^I'm glad to hear it. I have checked the sewer passages. If you're sure about this, then here's a map, and some gloves.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^When does the council meet?","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^In an hour. You'd probably better hurry. I don't know how long it will take you to navigate. Naturally, I didn't test it myself.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Wait, Ariar. Did you suggest I should go just so you don't have to climb through the sewage.","\n",{"#":"name Ariar"},{"#":"sprite AriarHappy"},"^You catch on quick.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^I'm an investigator.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Right. Well, I am more than willing to go myself, although I must admit I'd prefer not to. I dread the thought of getting caught by my House leader while covered in sewage. For you it would be much easier to escape the situation without being reprimanded.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Thanks, Ariar. If that is the case, I will go. I'd like to see the council directly.","\n",{"#":"name Ariar"},{"#":"sprite AriarHappy"},"^Make sure to take the gloves. I think they will prove useful.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Of course, Ariar. I will be leaving presently.","\n",{"#":"name Ariar"},{"#":"sprite AriarHappy"},"^Good. I'll be off to get some air fresheners and cleaning supplies. You're not getting in there clean, and the office is not going to suffer for it.","\n",{"#":"bg blackscreen"},"^Cut to MC in black screen. Presumed sewage.","\n",{"#":"name MC"},{"#":"sprite MCDisgusted"},"^Ah. Ew. I don't even want to know what this stuff is. Ugh, that smell. I have to be close by now. More importantly, I gotta get out of this stuff. Wait, I hear a noise. That sounds like the council. Aha! Here it is.","\n","^You appear, looking at the council through a small hole in the wall.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Looks like Ariar's information was on point. *Sniffs the air* I hope they get some extra strength cleaning supplies, or else I'll never salvage this outfit.","\n","^You move to a vantage point above the main room, where all the house leaders are seated, currently in idle chatter as the final members make their way inside.","\n",{"#":"bg HouseCourt"},"^Location: House Court (Olympus-Like)","\n","^House Cherry Blossom's members are the last to enter, but instead of the leader, the lieutenant of the house enters instead.","\n",{"#":"name Yvel Drellcon"},{"#":"sprite YvelDrellconIdle"},"^I would like to extend my leader's apologies to you. Unfortunately they are indisposed at the moment, and I have come in their stead.","\n",{"#":"name Crell Trillo"},{"#":"sprite CrellTrilloIdle"},"^Not to worry, we are glad that you, at least, are here.","\n",{"#":"name Rivera Klash"},{"#":"sprite RiveraKlashIdle"},"^Indeed. And now that you are, shall we commence?","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^[Thinks internally], first Ariar wasn't on board with coming to this, now one of the leaders has something else going on? Am I the only person who wants to be here?","\n",{"#":"name Sevelia Crush"},{"#":"sprite SeveliaCrushIdle"},"^Before we commence, we must first take roll for the records. House Ivy?","\n",{"#":"name Levalon Philel"},{"#":"sprite LevalonPhilelIdle"},"^Rest assured we would not miss such an important council.","\n",{"#":"name Sir Richter Kel Veridian X"},{"#":"sprite SirRichterKelVeridianXIdle"},"^Yes, indeed.","\n",{"#":"name Sevelia Crush"},{"#":"sprite SeveliaCrushIdle"},"^House Holly?","\n",{"#":"name Crell Trillo"},{"#":"sprite CrellTrilloIdle"},"^I note my presence.","\n",{"#":"name Lilhelm"},{"#":"sprite LilhelmIdle"},"^I note my presence as well.","\n",{"#":"name Sevelia Crush"},{"#":"sprite SeveliaCrushIdle"},"^House Spider-Lilly?","\n",{"#":"name Kelxcex Pvelox"},{"#":"sprite KelxcexPveloxIdle"},"^Whatever. I'm here.","\n",{"#":"name Madam Xelnoric Xil Crevelar"},{"#":"sprite MadamXelnoricXilCrevelarIdle"},"^...","\n",{"#":"name Sevelia Crush"},{"#":"sprite SeveliaCrushIdle"},"^Madam Xelnoric Xil Crevelar?","\n",{"#":"name Madam Xelnoric Xil Crevelar"},{"#":"sprite MadamXelnoricXilCrevelarIdle"},"^Yeah, here.","\n",{"#":"name Sevelia Crush"},{"#":"sprite SeveliaCrushIdle"},"^And as we know, one leader from House Cherry Blossom is present.","\n",{"#":"name Yvel Drellcon"},{"#":"sprite YvelDrellconIdle"},"^Yes. I extend my apologies once more.","\n",{"#":"name Sevelia Crush"},{"#":"sprite SeveliaCrushIdle"},"^And of course, both of us from Belladonna are here.","\n",{"#":"name Rivera Klash"},{"#":"sprite RiveraKlashIdle"},"^Indeed we are. Now we may commence with the council.","\n",{"#":"name Levalon Philel"},{"#":"sprite LevalonPhilelIdle"},"^I speak on behalf of House Ivy that we are truly concerned, not just for ourselves, but for the whole of the world. We hope you have all managed without any severe accidents or injuries.","\n",{"#":"name Kelxcex Pvelox"},{"#":"sprite KelxcexPveloxAngry"},"^Speak for yourself! We all know what we're gathering for, might as well lay it all out on the table. Magic is destabilizing, and one of our own nearly lost their life when their magic failed them. We need to find who is responsible and why!","\n",{"#":"name Lilhelm"},{"#":"sprite LilhelmIdle"},"^I certainly agree with both of you. House Holly is extremely distressed about the magic destabilizing, and we will take all possible action to aid in correcting the issue and punishing those who have caused it. But we must also ensure that everyone is safe.","\n",{"#":"name Yvel Drellcon"},{"#":"sprite YvelDrellconIdle"},"^Yes, Patience is key to all our actions.","\n",{"#":"name Madam Xelnoric Xil Crevelar"},{"#":"sprite MadamXelnoricXilCrevelarIdle"},"^Those are fine points, but what is there to bring to the table. You may have not brought up your own troubles, but it is simple enough to read upon your faces that you are having similar experiences with the magic. Has anyone found the source of this?","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^It makes sense that House Spider-Lily would be angry. Demons are often most vulnerable to destabilized magic.","\n",{"#":"name Sevelia Crush"},{"#":"sprite SeveliaCrushIdle"},"^You are correct in your presumptions of our current situation, but I'm afraid that we know little. This mystical malady strikes without warning, and we have found no correlation between it's victims. Be they young or old, talented or inept, members of our house are being stripped of their magic.","\n",{"#":"name Sir Richter Kel Veridian X"},{"#":"sprite SirRichterKelVeridianXIdle"},"^Yes, this certainly seems to affect all individuals in a similar way. We have put together an emergency task force to address the issue and protect all citizens from this... despicable curse.","\n",{"#":"name Kelxcex Pvelox"},{"#":"sprite KelxcexPveloxIdle"},"^That's a wonder, Richter. Have you considered that other houses may benefit from a similar task force. Especially houses less wealthy than yours.","\n",{"#":"name Yvel Drellcon"},{"#":"sprite YvelDrellconAngry"},"^This is getting us nowhere. I commend you all on addressing the safety of your houses, but we must take action to find who is responsible.","\n",{"#":"name Crell Trillo"},{"#":"sprite CrellTrilloAngry"},"^Do not fool yourselves, Kelxcex. The only reason you find yourself financially weakened is because you spend your wealth on pointless regalities.","\n",{"#":"name Rivera Klash"},{"#":"sprite RiveraKlashAngry"},"^Let us stop bickering and pointing fingers. Punishing the perpetrator will do little for us if we cannot treat those afflicted. Our world cannot last without magic, we must find a way to maintain it.","\n",{"#":"name Levalon Philel"},{"#":"sprite LevalonPhilelIdle"},"^Then you shall have my support. We cannot allow ourselves and our fellows to be rendered incapable of weaving magic. However, so far, we have not found a way to reverse the effects, only to slow them.","\n",{"#":"name Rivera Klash"},{"#":"sprite RiveraKlashTdle"},"^Do tell.","\n",{"#":"name Levalon Philel"},{"#":"sprite LevalonPhilelIdle"},"^Unfortunately we have found that the more one practices their arcane abilities, the faster their ability to call upon magic is drained. What was once a constant supply has now become finite. You yourself may be already affected, but your magic has yet to be drained to noticeable levels.","\n",{"#":"name Sevelia Crush"},{"#":"sprite SeveliaCrushIdle"},"^Then perhaps we should enact a limit on practicing magic as quickly as possible. If we are to preserve our talents, we take preventative action.","\n",{"#":"name Crell Trillo"},{"#":"sprite CrellTrilloIdle"},"^If this is what is best for all the houses as a whole, then House Holly is in full support of this magic limit. We want what is best to protect our citizens.","\n",{"#":"name Madam Xelnoric Xil Crevelar"},{"#":"sprite MadamXelnoricXilCrevelarAngry"},"^Of course you would say this, Sevelia. Not one member of our house would so willingly limit their magic.","\n",{"#":"name Sir Richter Kel Veridian X"},{"#":"sprite SirRichterKelVeridianXAngry"},"^You dare to deny our free magic use? Free use of Magic is a fundamental right that was agreed upon indefinitely by our ancestors. Are you suggesting we turn from tradition and ignored those before us. Many leaders of House Ivy before me fought for the maintenance of this right, some have even died for it. If you even, for a second, consider that I would not do the same, than you are nothing but a pitiful fool. House Ivy does not tolerate even the consideration of a magic limit. You are all blind.","\n",{"#":"name Yvel Drellcon"},{"#":"sprite YvelDrellconAngry"},"^Maintain yourself, Richter. It serves no benefit to grow angry.","\n",{"#":"name Sir Richter Kel Veridian X"},{"#":"sprite SirRichterKelVeridianXAngry"},"^No. I will not tolerate this behavior. You are all an embarrassment to the world. Especially you, Belladonna, to propose such a thing so calmly. And Holly, your audacity to be complicit in such a heinous crime. I have had enough!","\n","^A fight breaks out.","\n",{"#":"name MC"},{"#":"sprite MCScared"},"^This is a nightmare. I need to get out of here, but there could be someone in trouble down there.","\n","^There is a massive magic explosion.","\n",{"#":"name MC"},{"#":"sprite MCShocked"},"^That was... that was magic! Someone here has only grown stronger in their magic. I have to get out of here before my cover is blown!","\n",{"->":"0.g-0"},{"#f":5,"#n":"g-0"}],null],["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}