{"inkVersion":20,"root":[[{"#":"bg Alley"},"^Location: Undisclosed Warehouse/Alley","\n","^Opens with you walking down the street, navigating their way to the address that is written on the letter.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^123 I-Don't-Want-to-be-here-Street.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Yeah, this is the place. Nobody around, what could be here that needs my help? This place couldn't be helped by House Holly on a good day.","\n","^The MC's phone begins to ring, and as they pick it up, they hear the voice of Ariar on the other end.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Hey did you get to the place? Find anything yet?","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Yeah, I found the place easy enough.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Big warehouse, though looks as empty as the street that I had to take to get here. Find anything interesting about it with your research?","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Nothing yet. Built a few decades back, and hasn't seen commercial use in at least a few years. Now it's only used by the local kids and strays.","\n",{"#":"name MC"},{"#":"sprite MCAngry"},"^If this is another stolen cat I am going to explode.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Don't worry, I checked the Zodiac board first thing after you left. Nobody has posted about missing pets recently.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^At least, nowhere around here.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Well, I suppose that's a relief.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Still leaves the question of why that letter came in. Stay on the line, I'm going to check out the inside.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Sure, keep me posted on any updates.","\n","^You move into the interior of the warehouse, holding the phone just a breadth away from their face.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Nothing here, I think we just got a prank call out here.","\n","^As you lower the phone to end the call, they are suddenly interrupted by a bolt of arcane energy streaking out from the rafters, striking their phone and sending it careening towards a wall, where it impacts with a resounding crunch.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Who is there? Show yourself!","\n","^A hooded figure, the Assassin, drops from their vantage point on the ceiling, landing on the floor like a fart on the wind. Silent, but deadly.","\n",{"#":"name Assassin"},{"#":"sprite AssassinAngry"},"^You are a selfless fool, yet I envy your audacity.","\n",{"#":"name MC"},{"#":"sprite MCAngry"},"^What are you talking about?","\n",{"#":"name MC"},{"#":"sprite MCAngry"},"^How dare you attack an investigator.","\n",{"#":"name Assassin"},{"#":"sprite AssassinAngry"},"^You know the inevitability of a house war. Yet despite this knowledge you have chosen not to aid, but to stay away.","\n",{"#":"name Assassin"},{"#":"sprite AssassinAngry"},"^You allow the world to crumble, the houses to be destroyed, then you are in charge of the world.","\n",{"#":"name Assassin"},{"#":"sprite AssassinAngry"},"^No damage comes to you, yet the rest of us have to die.","\n",{"#":"name Assassin"},{"#":"sprite AssassinAngry"},"^It is not right that the rest of us be punished for your absence. That's why you have to die instead.","\n",{"#":"name MC"},{"#":"sprite MCAngry"},"^In that case, I'll grant you a premature death.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}