{"inkVersion":20,"root":[["^Location: House Ivy","\n","^Scene opens at the night, as the MC makes their way around the House Ivy grounds, taking care to not trespass, while still observing the interior. The main structures are silhouetted by the moon and stars, windows occasionally illuminated by lights within. They casually walk up to the front gate, where a guard stands vigilant.","\n",{"#":"name MC"},"^Hey there, may I pass? I have some important business to attend to with the heads of House Ivy.","\n",{"#":"name Guard Bellaben Sliver"},"^And who might you be?","\n",{"#":"name MC"},"^Uhhh, I'm a delegate from House Holly. My leaders were hoping to establish some communication regarding the recent events.","\n",{"#":"name Guard"},"^Then you should know that House Ivy is not taking any visitors, delegates or otherwise, until further notice. We are dealing with recent events as much as you are, and for the time being, none are allowed within. Leave the premises or be escorted off.","\n",{"#":"name MC"},"^Very well then. I shall let my leaders know of these occurrences.","\n","^The MC wanders off, annoyed by the refusal of entry, but not frustrated, as such a way through would have been a bit too easy for their liking. Considering their options, the MC dials Ariar, speaking to them over the phone.","\n",{"#":"name Ariar"},"^Was wondering when you'd hit me up. Did the pizza delivery ruse make yet another successful encore?","\n",{"#":"name MC"},"^Unfortunately no, seems like Philel was not in the mood for the sauce tonight, and they're not seeing any visitors either.","\n",{"#":"name Ariar"},"^Well I know you never hope for that stuff to work anyways. If it's easy, that means you should at least give it a shot. If you don't get the results you're looking for, you can always start trying out different methods.","\n",{"#":"name MC"},"^I also prefer to work without too much deception. We're here to reveal the truth, and any step in the other direction is one I would rather not take.","\n",{"#":"name Ariar"},"^Fine fine, whatever works for you. What are we looking at in terms of security there? Never had the pleasure of looking at House Ivy's security, but something tells me you're going to be wishing you were delivering pizza by the end of tonight.","\n",{"#":"name MC"},"^It's honestly quite impressive, I've never seen runes this complex before. They're really serious about keeping anyone out. Some kind of sensory link enchantment that not only prevents entry, but seems to monitor all that takes place on the barrier. Not exactly a hair trigger, but I'm going to be wary of even tossing a pebble in to test the measures they've got behind it.","\n",{"#":"name Ariar"},"^Then that means you're going to need to get extra creative now. I'll try looking into some befuddlement charms. They might be able to circumvent a sensory link-type barrier, though you'll still need to punch through it.","\n",{"#":"name MC"},"^Alrighty then, send me the info when you find it, I'll try out some tricks of my own.","\n","^Hanging up, the MC's frown curves into a smile, invigorated by the challenge and allure of the investigation.","\n",{"#":"name MC"},"^Then I suppose that it's up to me to figure a way to get in.","\n","^After some time is passes, and they appear frustrated, the protection around House Ivy being more secure than they could have ever anticipated.","\n",{"#":"name MC"},"^Damn, they're really pulling no punches here. They must really value personal security, or they have something to hide. And no calls from Ariar, I guess the charm route didn't lead to anything.","\n","^Quietly plodding along the perimeter of the barrier the MC whispers a small incantation under their breath.","\n",{"#":"name MC"},"^Quod sentis non est halitus, torpens, serenus, tacitus met.","\n","^The magic glows a deep maroon as they finish, but it fizzles out, the magic failing before it even leaves their fingers.","\n",{"#":"name MC"},"^Come on, that is the limit? How am I supposed to cross through an arcane barrier without a lick of magic to help me out?","\n","^An electric crackling noise sounds out, and the MC turns around as a tear forms near the barrier. It widens, revealing the interior of a hallway, emblems of House Ivy giving context of the location.","\n",{"#":"name MC"},"^Huh? What's this? It's not like any magic I've seen before, and I've certainly not cast it.","\n","^The MC approaches the tear, peering inside.","\n",{"#":"name MC"},"^Wait, is this some kind of portal? Is the destabilization of magic causing space itself to break down in places? I can see through it, it is House Ivy! This makes little sense, but it's the best bet I've found so far.","\n","^MC enters the portal. They are now in House Ivy.","\n",{"#":"name MC"},"^Wow. That works. Surely a danger to the world, but at least it was a danger that benefitted me for once. Now to begin searching for evidence.","\n","^MC is caught by Levalon Philel while sneaking around.","\n",{"#":"name Levalon Philel"},"^I don't expect you have any good reason for sneaking around my House so dishonorably?","\n",{"#":"name MC"},"^Oh, hey, it's you. Great.","\n",{"#":"name Levalon Philel"},"^Our borders are closed. How did you get in?","\n",{"#":"name MC"},"^Well, frankly, I'm not too sure myself. It was very strange.","\n",{"#":"name Levalon Philel"},"^I am not a fool, child. The only possible way for you to have entered is by bribing a guard. Give me names.","\n",{"#":"name MC"},"^Brilliant deduction, Levalon. But unfortunately it's completely incorrect.","\n",{"#":"name Levalon Philel"},"^Stop stalling. You are in direct violation with the laws of House Ivy.","\n",{"#":"name MC"},"^Yes, yes. I'm very familiar with the law. I'm an investigator.","\n",{"#":"name Levalon Philel"},"^Yes, I am familiar with your work, being neutral and all. However, despite being neutral from all houses, that does not give you free reign to break the House laws. While you are here, you will be treated to the same justice.","\n",{"#":"name MC"},"^Don't tell me about justice. The only reason I am here is because your own house doesn't trust you anymore.","\n",{"#":"name Levalon Philel"},"^Naturally. That is why our borders are closed. We must prove our own innocent before allowing ourselves to be seen in scrutiny. Unless you have proof of your innocence, there is no need for our discussion.","\n",{"#":"name MC"},"^I hope you understand that the only reason I am here is to prove you innocent. I understand why you closed your boarders, but that has only made the public question you more. I was asked to investigate your house with an unbiased eye. If it is true that your House did commit these crimes, there will be a revolt. The only thing greater to a Duhhahan than loyalty is pride. They will not tolerate acts of an unjust war. So, if you are innocent, I am the one who can save you.","\n",{"#":"name Levalon Philel"},"^You are wise. That I must regrettably admit. But there is no benefit to us making enemies of the world. I will certainly condemn Sir Richter for his behavior at the council. But he was correct about one thing.","\n",{"#":"name MC"},"^What is that?","\n",{"#":"name Levalon Philel"},"^That the most important matter to House Ivy is maintaining the laws enacted by our ancestors. House Ivy seeks to keep peace. Right now, the public needs a House to blame with anger. For the time being, we are that house, but we must soon use this anger to punish those who have sought to harm this world and all who inhabit it.","\n",{"#":"name MC"},"^We are in agreement, Levalon. We both hope that those truly guilty will face the fullest consequence for their behavior. I simply hope that is not you.","\n",{"#":"name Levalon Philel"},"^Something that will be proven in time.","\n",{"#":"name MC"},"^I suppose you're not still wondering how I got here?","\n",{"#":"name Levalon Philel"},"^A question that no longer needs to be answered. I recognize you entered our House with noble intent. Even if that nobility involved breaking the law. You will not be punished, despite your guilt. You are one of good morals. That is a vanishing breed. I cannot provide aid in your quest, but I will not punish you for trying. But rest assured, House Ivy still takes the law quite seriously. Any further attempt to break our law will be punished, regardless of how noble the cause.","\n",{"#":"name MC"},"^I understand, Levalon. Thank you for your generosity. If you are truly innocent, I wish you the best of fortunes to prove that innocence in a timely manner.","\n",{"#":"name Levalon Philel"},"^Indeed. But you must now leave.","\n",{"#":"name MC"},"^I will. And I will not argue.","\n",["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}