{"inkVersion":20,"root":[["^Location: Courtyard","\n","^Takes place in an outside courtyard, where the MC is idling by before Galedric approaches them, ushering them to the side to talk in private.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Everyone still seems so riled up about this magic thing. I don't blame them, I'm bothered to. But I must stay calm until this matter is cured. It serves no good to the public if those who aught to be protecting them begin to panic as well.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Hello? Is your head stuck in the clouds?","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Oh, hey.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Are you feeling alright? Still worn out from the magic incident?","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^No, well, I suppose in a new way, yes. I have recovered from my incident with the assassin, but now I find myself in more mental turmoil. Magic has been the center to this world, and now it's gone. It makes me wonder, what would happen next? We can no longer trust that those things we once considered normal will maintain. And when that sense of normality is lost, the public is lost, too.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Hold on, friend. We still have a while to fix things before we have to worry about the end of the world.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^You have me all wrong, Ariar. I'm not worried about the end of the world, I'm worried about the end of any perceived purposes in life. People are not so quick to move on without a fight. Perhaps this House War truly is inevitable.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^We have known that a House War has been inevitable since the Houses were forged centuries ago. All we can hope is that when it happens, the better of the people results. War is undesirable, I agree, but when it does come, we can only hope that those who only live to cause tension and anger are the ones who are eradicated.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^And we must also hope that all those who inhabit the world are safe. Although, that much is not an easy goal to achieve.","\n",{"#":"name Ariar"},{"#":"sprite AriarIdle"},"^Unfortunately, I think you're right. The best purposes in life are often those most difficult to obtain.","\n",{"#":"name Galedric"},{"#":"sprite GaledricIdle"},"^Pardon my interruption. May we talk for a moment? I don't know how aware you are of recent events, but given your profession and skill, I suspect you have heard about what happened a few days prior at the council, am I correct?","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^On that suspicion, you are correct, old friend. How may I be of service to you?","\n",{"#":"name Galedric"},{"#":"sprite GaledricIdle"},"^Excellent, you are up to date, as expected. I'm hoping you could assist me in some matters more under the table for now.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^You know my methods, confidentiality is something I take pride in providing. What are you looking for?","\n",{"#":"name Galedric"},{"#":"sprite GaledricIdle"},"^(In hushed tones) As you know, the debacle earlier has thrown many a house into chaos. But one rumor I keep on hearing circulate around more than others is that my house, House Ivy is to blame. I was hoping that you would be able to provide some perspective, to investigate my house? I fear that my words would fall upon deaf ears if I attempted to defend them, but you would not be as single-mindedly distrusted I would.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^I can certainly do that for you. Truth to be told, I was already planning on doing some snooping myself, something about the events that night just don't line up for me.","\n",{"#":"name Galedric"},{"#":"sprite GaledricIdle"},"^Excellent, but do tread carefully. My house is not unaware of the suspicions against them. Our borders are being tightened, and any trespassers are to be dealt with without impunity. Even as an outsider to all houses, you would likely be regarded as a potential threat.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Good to know, Galedric. You mentioned confidentiality, I presume you wish me to keep these activities a secret from your fellow house members as well? Or is there anoGaledricther who I could trust on the inside?","\n",{"#":"name Galedric"},{"#":"sprite GaledricIdle"},"^I'm afraid that I'm the only one you'll be able to turn to once you're inside the borders, but I can't risk being too heavily associated. I wish to make sure my house is not to blame for the degradation of magic, nor the attack at the council.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Then you can put your trust in me. I shall uncover the truth, but know that if your house is responsible, I cannot simply withhold the truth from others.","\n",{"#":"name Galedric"},{"#":"sprite GaledricIdle"},"^I understand, but I know from the bottom of my heart that we are not responsible. Something strange is afoot, but none of us can uncover it on our own.","\n",{"#":"name MC"},{"#":"sprite MCIdle"},"^Very well then. Wish me luck.","\n",{"#":"End Scene"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"#f":1}],"listDefs":{}}